# # <center>Machine Learning e DS com Python de A a Z</center>

Tipo de Variáveis</br>
Numéricas & Categóricas</br>
Numéricas => Contínuas e Discretas</br>
Categóricas => Nominal e Ordinal

### Importação das Bibliotecas Padrões (básicas)

In [1]:
%pip install plotly

Requirement already satisfied: plotly in c:\users\u11372\anaconda3\lib\site-packages (5.13.0)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: tenacity>=6.2.0 in c:\users\u11372\anaconda3\lib\site-packages (from plotly) (8.0.1)

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns ## Biblioteca para visualização de gráficos
import matplotlib.pyplot as plt
import plotly.express as px ## Biblioteca para gráfico dinâmico

#### Exploração dos Dados

In [3]:
dados_credito = pd.read_csv('credit_data.csv')
dados_credito.head(3)

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0

In [4]:
## Visualização de Estatíticas pré-escritas pelos pandas
dados_credito.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [5]:
## Aplicando filtros
dados_credito[dados_credito['income'] > 69995]

     clientid        income        age         loan  default
422       423  69995.685578  52.719673  2084.370861        0

In [6]:
dados_credito[dados_credito['loan'] < 1.377630]

     clientid        income        age     loan  default
865       866  28072.604355  54.142548  1.37763        0